package com.company.反射机制;

/**
 * 1. 反射机制的作用:
 *    (1) 通过java语言中的反射机制可以操作字节码文件.
 *        优点类似于黑客(可以读和修改字节码文件).
 *        通过反射机制可以操作代码片段(class文件).
 *    (2) 反射机制可以使得程序更加灵活.
 *
 * 2. 反射机制的相关类在哪个包下:
 *    java.lang.reflect.*;
 *
 * 3. 反射机制相关的重要类有哪些:
 *    (1) java.lang.Class : 代表整个字节码, 代表一个类型, 代表整个类.
 *    (2) java.lang.reflect.Method : 代表字节码中的方法字节码, 代表类中的方法.
 *    (3) java.lang.reflect.Constructor : 代表字节码中的构造方法字节码, 代表类中的构造方法.
 *    (4) java.lang.reflect.Field : 代表字节码中的属性字节码, 代表类中的成员变量(静态变量+实例变量).
 *
 * 5. 总结:
 *    这个部分主要就两点: 一是反射机制的作用; 二是反射机制相关的四个重要类(类, 方法, 构造方法, 字段).
 */
public class 反射机制概述 {
}
