package com.company.集合;

/**
 * 1. 说明: 集合实际上就是一个容器, 用来存储其他类型.
 *
 * 2. 分类:
 *    (1) 按存储的方式分类分为两种: 一个一个存(collection)[线性结构]; 一对一对存(map)[非线性结构].
 *    (2) 按类型主要分为三种:
 *        1> list : 有序集合, 可以存放重复的数据;
 *        2> set : 无序集合, 不允许存放重复的数据;
 *        3> map: 无序集合, 集合中包含一个键对象, 一个值对象, 键对象不允许重复, 值对象可以重复.
 *
 * 3. 重点(两点):
 *    (1) java中, 集合只能用来存储引用类型.
 *    (2) 集合底层是数据结构, 例如: 数组, 二叉树, 哈希表等等.
 *
 * 4. 注意:
 *    (1) 数据结构分为线性结构和非线性结构.
 *    (2) 线性结构特点就是一对一. 线性表又分为顺序表和链表. 线性表包括数组, 队列, 栈和链表.
 *        所以collection中包括列表(数组, 链表), 集合, 队列, 栈等.
 *    (3) 非线性结构特点是一对多, 包括树, 广义表, 图等.
 *
 * */
public class 主要集合概念 {
}
